# Cross-platform (macOS and Linuxbrew): CLI media tools as formulae so
# convert/mogrify and mkvmerge/mkvextract sit directly in PATH for scripting;
# a Flatpak would hide them behind `flatpak run --command=`.
brew "imagemagick"
brew "mkvtoolnix"

if OS.mac?
    # Runtimes
    # app is native, but translating x86 Windows code needs rosetta
    # (native arm64 build announced for CrossOver 27, not shipped yet)
    cask "crossover"

    # Entertainment
    # client is native since mid-2025; x86 games still run under rosetta
    cask "steam"
    cask "playcover-community"

    # Multimedia
    cask "plex"
    cask "iina"
    cask "vlc"
    mas "ApolloOne", id: 1044484672

    # Engineering
    cask "bambu-studio"

    # Misc Tools
    cask "balenaetcher"

    # Multimedia tools
    cask "handbrake"
    cask "mediainfo"
    # GUI app; the CLI tools come from the cross-platform formula above
    cask "mkvtoolnix"
    cask "mp3tag"

    # Downloader
    cask "jdownloader"

    # Communication
    cask "discord"

    # System
    cask "appcleaner"
    cask "lulu"
    # both ship a kext: one-time Reduced Security + kext approval in
    # RecoveryOS required; license activation stays manual
    cask "paragon-ntfs"
    cask "paragon-extfs"
    # for nsusbloader
    brew "libusb"

    # Not available via brew
    # filezilla
    # nsusbloader

    # Installed manually
    # Perfect privacy (take the ARM pkg, not the Intel one)

    # Installed manually via Crossover
    # Batch Renamer Utility
    # Subtitle Edit

    # iOS apps from mas
    # Threes
    # Boost 2
    # Canabalt
    # Smash Hit
    # Tiny Wings
    # Hurdler
    # König der Mathematik
    # GeoDefense

    # Installed manually
    # Temple Run
    # Jetpack Joyride 2
    # Pathfinder
    # Photoshop
    # Lightroom Classic
    # Premiere
    # Media Encoder
    # Acrobat Pro
end
